def dict_select(user_id):
    '''
    maj_dict = {
        전공: [0.줄임말, 1.단일전공학점, 2.단일전공전필, 3.단일전공선필, 4.복수전공학점, 5.복수전공전필, 6.복수전공선필, 7.총이수학점]
        }
    '''
    if user_id in ['12', '13', '14', '15']:
        maj_dict = {
            '경영정보전공': ['경정', 60, 7, 0, 45, 4, 0, 130],
            '회계세무전공': ['회세', 60, 9, 0, 45, 4, 0, 130],
            '무역학과': ['무역', 60, 9, 0, 45, 4, 0, 130],
            '경영학과': ['경영', 60, 9, 0, 45, 4, 0, 130],
            '법학과': ['법', 60, 1, 5, 42, 0, 5, 136],
            '행정학과': ['행정', 60, 1, 5, 42, 0, 5, 130]
            }
    elif user_id == '16':
        maj_dict = {
            '경영정보전공': ['경정', 60, 7, 0, 45, 4, 0, 130],
            '회계세무전공': ['회세', 60, 9, 0, 45, 4, 0, 130],
            '무역학과': ['무역', 60, 8, 0, 45, 4, 0, 130],
            '경영학과': ['경영', 60, 9, 0, 45, 4, 0, 130]
            }
    elif user_id == '17':
        maj_dict = {
            '경영정보전공': ['경정', 60, 7, 0, 45, 4, 0, 130],
            '회계세무전공': ['회세', 60, 9, 0, 45, 4, 0, 130],
            '무역학과': ['무역', 60, 9, 0, 45, 4, 0, 130],
            '경영학과': ['경영', 60, 9, 0, 45, 4, 0, 130]
            }

    return maj_dict